'''
ต้นไม้หยาบเป็นต้นไม้แบบ Complete Binary Tree มีทั้งสิ้น N โหนด การเรียกชื่อโหนดจะเรียกเป็นโหนดที่ 1,2,3,... ไปเรื่อยๆจนถึงโหนดที่ N เริ่มต้นจะเติมค่าตั้งแต่โหนดที่ [N / 2] + 1 ไปจนถึงโหนดที่ N ต่อมาจะมีการขีดฆ่าต้นไม้หยาบ จากโหนดลูกสองโหนดใดๆที่อยู่ติดกัน โดยใช้หลักการว่าโหนดพ่อจะเอาค่าของโหนดลูกที่มีค่าน้อยที่สุดขึ้นมา แล้วลบค่าของโหนดลูกทั้งสองด้วยค่านั้น ให้นักศึกษาเขียนโปรแกรมเพื่อหาผลรวมโหนดภายหลังการขีดฆ่าต้นไม้หยาบ

โดย input จะแบ่เป็น 2 ฝั่งด้วย /
1. ด้านซ้ายจะเป็นจำนวนโหนด (N) โดยรับประกันว่ามีจำนวนโหนดอย่างต่ำที่สุดคือ 3
2. value จำนวน [N / 2] + 1 ค่า เป็นค่าตั้งแต่โหนดที่ [N / 2] + 1 จนถึง N และถ้าหากจำนวน value ไม่เท่ากับ [N / 2] + 1 จะแสดงผลลัพธ์เป็น "Incorrect Input"

หมายเหตุ ต้นไม้ในข้อนี้ไม่จำเป็นต้องเป็น Perfect Binary Tree แต่จำเป็นต้องมีจำนวนโหนดเป็นเลขคี่
'''


n, inp = input("Enter Input : ").split("/")
n = int(n)

inp = inp.split()
inp = list(map(int, inp))

if (n+1)//2 >= len(inp):
    i = 0
    while len(inp) < n:
        inp.insert(0, -111)
        i += 1

    def cal(cur):

        if inp[cur] != -111:
            return

        cal(2*cur+1)
        cal(2*cur+2)

        x = min(inp[2*cur+2], inp[2*cur+1])
        inp[cur] = x
        inp[2*cur+1] -= x
        inp[2*cur+2] -= x


    cal(0)
    print(sum(inp))

else:
    print("Incorrect Input")